fonecmid-diplom.Расширение/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e774faa1-e972-468e-9960-e07838851b78">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговораОбслуживания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговораОбслуживания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a81d1f8d-ea75-4cec-9742-5970eceda758">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7578fe6c-f228-48d8-9c9b-2c2c261009e2">
    <name>ВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom.Расширение/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4bcf5efc-d119-4131-835d-815195fc8c51">
  <name>ВидыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom.Расширение/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлементаДоговораОбслуживания/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//	//Добавить поля для договора обслуживания
	ГрДог = Элементы.Добавить("ГруппаДоговора", Тип("ГруппаФормы"), ЭтотОбъект);
	ГрДог.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГрДог.Заголовок="Параметры договора";
	ГрДог.ОтображатьЗаголовок = Ложь;
	ГрДог.Видимость =  Истина;

	ВКМ_Код = Элементы.Добавить("_Код", Тип("ПолеФормы"), ГрДог);
	ВКМ_Код.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_Код.ПутьКДанным  = "Объект.Код";
	ВКМ_Код.Видимость = Истина;

	ВКМ_Наименование = Элементы.Добавить("_Наименование", Тип("ПолеФормы"), ГрДог);
	ВКМ_Наименование.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_Наименование.ПутьКДанным  = "Объект.Наименование";
	ВКМ_Наименование.Видимость = Истина;

	ВКМ_Организация = Элементы.Добавить("_Организация", Тип("ПолеФормы"), ГрДог);
	ВКМ_Организация.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_Организация.ПутьКДанным  = "Объект.Организация";
	ВКМ_Организация.Видимость = Истина;

	ВКМ_ВидДоговора = Элементы.Добавить("_ВидДоговора", Тип("ПолеФормы"), ГрДог);
	ВКМ_ВидДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ВидДоговора.ПутьКДанным  = "Объект.ВидДоговора";
	ВКМ_ВидДоговора.Видимость = Истина;
	ВКМ_ВидДоговора.УстановитьДействие("ПриИзменении", "ПриИзмененииВидаДоговора"); 
	
	
	//Добавить поля для договора обслуживания
	ГрОбсл = Элементы.Добавить("ГруппаОбслуживания", Тип("ГруппаФормы"), ЭтотОбъект);
	ГрОбсл.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГрОбсл.Заголовок="Параметры договора обслуживания";
	ГрОбсл.Видимость =  ЭтоДоговорОбслуживания();

	ВКМ_ДатаНачалаДоговораОбслуживания = Элементы.Добавить("_ДатаНачалаДоговораОбслуживания", Тип("ПолеФормы"), ГрОбсл);
	ВКМ_ДатаНачалаДоговораОбслуживания.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачалаДоговораОбслуживания.ПутьКДанным  = "Объект.ВКМ_ДатаНачалаДоговораОбслуживания";
	ВКМ_ДатаНачалаДоговораОбслуживания.Видимость = ЭтоДоговорОбслуживания(); 
	
	//ВКМ_ДатаОкончанияДоговораОбслуживания
	ВКМ_ДатаОкончанияДоговораОбслуживания = Элементы.Добавить("_ДатаОкончанияДоговораОбслуживания", Тип("ПолеФормы"),
		ГрОбсл);
	ВКМ_ДатаОкончанияДоговораОбслуживания.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончанияДоговораОбслуживания.ПутьКДанным  = "Объект.ВКМ_ДатаОкончанияДоговораОбслуживания";
	ВКМ_ДатаОкончанияДоговораОбслуживания.Видимость = ЭтоДоговорОбслуживания(); 
	
	//ВКМ_СуммаЕжемесячнойАбонентскойПлаты
	ВКМ_СуммаЕжемесячнойАбонентскойПлаты = Элементы.Добавить("_СуммаЕжемесячнойАбонентскойПлаты", Тип("ПолеФормы"),
		ГрОбсл);
	ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СуммаЕжемесячнойАбонентскойПлаты.ПутьКДанным  = "Объект.ВКМ_СуммаЕжемесячнойАбонентскойПлаты";
	ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость = ЭтоДоговорОбслуживания(); 
	
	//ВКМ_СтоимостьЧасаРаботыСпециалиста
	ВКМ_СтоимостьЧасаРаботыСпециалиста = Элементы.Добавить("_СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"), ГрОбсл);
	ВКМ_СтоимостьЧасаРаботыСпециалиста.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьЧасаРаботыСпециалиста.ПутьКДанным  = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
	ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = ЭтоДоговорОбслуживания();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПриИзмененииВидаДоговора(Элемент)
	Если ЭтоДоговорОбслуживания() Тогда
		Элементы.ГруппаОбслуживания.Видимость = Истина;
		Элементы._ДатаНачалаДоговораОбслуживания.Видимость = Истина;
		Элементы._ДатаОкончанияДоговораОбслуживания.Видимость = Истина;
		Элементы._СуммаЕжемесячнойАбонентскойПлаты.Видимость = Истина;
		Элементы._СтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
	Иначе
		Элементы.ГруппаОбслуживания.Видимость = Ложь;
		Элементы._ДатаНачалаДоговораОбслуживания.Видимость = Ложь;
		Элементы._ДатаОкончанияДоговораОбслуживания.Видимость = Ложь;
		Элементы._СуммаЕжемесячнойАбонентскойПлаты.Видимость = Ложь;
		Элементы._СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтоДоговорОбслуживания()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
#КонецОбласти
